namespace Script.SuanFaDaolun
{
    /// <summary>
    /// 基本数据结构
    /// </summary>
    public class Unit10
    {
        /*栈和队列
         *栈和队列都是动态集合，栈中删除的是最新插入的元素，栈实现的是一种后进先出的cel，
         *队列中，被删除的是集合中存在时间最长的元素，先进先出。
         */

        /* 栈
         * Push 压入
         * Pop 弹出
         */

        /*队列
         * Enqueue 入队
         * Dequeue 出队
         */

        /*链表
         * 链表提供了一种灵活的线性数据结构，链表的顺序由对象里的指针决定的。
         * 链表有很多种，单链表，双链表，环链表。
         *链表的搜素
         * 链表的搜索采用线性搜索方式，搜索的时间复杂度为O(n);
         * 链表的插入是O(1);
         * 链表的删除是O(n),因为要先找到这个元素。
         *哨兵
         * 可以使用哨兵来简化边界的处理，双线循环链表使用一个哨兵就可以了
         * 
         */
    }
}